In [1]:
import os


# Check the current working directory
print("Current Working Directory:", os.getcwd())

os.chdir(input())

# Verify the change was successful
print("New Working Directory:", os.getcwd())

Current Working Directory: /home/miguel.fernandez/ETL-Data-Science-Test/data_science/notebook
New Working Directory: /home/miguel.fernandez/ETL-Data-Science-Test/data_science

In [2]:
import pandas as pd

info_01 = pd.read_csv("data/info_01.csv")
info_02 = pd.read_csv("data/info_02.csv")

In [7]:
info_01.head()

   id  id2     v4    v5        v6
0   1    1  721.2  27.3  0.004793
1   1    1  721.2  27.3  0.004793
2   2    2  714.0  27.3  0.004783
3   2    2  714.0  27.3  0.004783
4   3    3  713.5  27.2  0.004779

In [11]:
len(info_01)

17286

In [10]:
info_01["id"].unique()

array([   1,    2,    3, ..., 8141, 8142, 8143], shape=(8143,))

In [ ]:
info_01['is_duplicated'] = info_01.duplicated(keep=False)

0        True
1        True
2        True
3        True
4        True
         ...
17281    True
17282    True
17283    True
17284    True
17285    True
Name: is_duplicated, Length: 17286, dtype: bool

In [20]:
duplicate_tuples = info_01[~info_01.duplicated(['id', 'id2'])]
print(duplicate_tuples)

         id   id2     v4    v5        v6
0         1     1  721.2  27.3  0.004793
2         2     2  714.0  27.3  0.004783
4         3     3  713.5  27.2  0.004779
6         4     4  708.2  27.2  0.004772
8         5     5  704.5  27.2  0.004757
...     ...   ...    ...   ...       ...
16276  8139  8139  787.2  36.1  0.005579
16278  8140  8140  789.5  36.0  0.005563
16280  8141  8141  798.5  36.1  0.005596
16282  8142  8142  820.3  36.3  0.005621
16284  8143  8143  821.0  36.2  0.005612

[8143 rows x 5 columns]

In [8]:
info_02.head()

   id  id2     v1  c1    v2                   v3
0   1    1  426.0   1  23.2  2015-02-04 17:51:00
1   1    1  426.0   1  23.2  2015-02-04 17:51:00
2   2    2  429.5   1  23.1  2015-02-04 17:51:59
3   2    2  429.5   1  23.1  2015-02-04 17:51:59
4   3    3  426.0   1  23.1  2015-02-04 17:53:00

In [12]:
len(info_02)

17286

In [24]:
info_01_filtered = info_01[~info_01.duplicated(['id', 'id2', 'v4', 'v5', 'v6'], keep='first')]
len(info_01_filtered)

8143

In [26]:
info_02_filtered = info_02[~info_02.duplicated(['id', 'id2', 'v1', 'v2', 'v3', 'c1'], keep='first')]
len(info_02_filtered)

9143

In [52]:
info = info_02_filtered.set_index(['id', 'id2']).join(info_01_filtered.set_index(['id', 'id2']), how="inner")
info[info['v3'].isna()]

             v1  c1    v2   v3     v4    v5        v6  is_duplicated
id   id2
1798 1798   0.0   0  20.3  NaN  445.0  21.3  0.003127           True
6177 6177   0.0   0  19.4  NaN  467.0  26.8  0.003725           True
4168 4168  50.0   0  21.8  NaN  441.3  18.2  0.002942           True
7572 7572   0.0   0  20.4  NaN  500.5  33.0  0.004891           True
6432 6432   0.0   0  19.4  NaN  460.0  26.8  0.003725           True
...         ...  ..   ...  ...    ...   ...       ...            ...
5411 5411  65.7   0  19.2  NaN  423.3  30.8  0.004235           True
6547 6547   0.0   0  19.3  NaN  463.0  26.1  0.003606           True
1806 1806   0.0   0  20.2  NaN  445.0  21.2  0.003104           True
5606 5606  58.8   0  20.1  NaN  420.2  26.3  0.003830           True
3689 3689   0.0   0  19.6  NaN  449.0  19.3  0.002729           True

[1000 rows x 8 columns]

In [55]:
info

,,v1,c1,v2,v3,v4,v5,v6,is_duplicated
id,id2,,,,,,,,
1,1,426.0,1,23.2,2015-02-04 17:51:00,721.2,27.3,0.004793,True
2,2,429.5,1,23.1,2015-02-04 17:51:59,714.0,27.3,0.004783,True
3,3,426.0,1,23.1,2015-02-04 17:53:00,713.5,27.2,0.004779,True
4,4,426.0,1,23.1,2015-02-04 17:54:00,708.2,27.2,0.004772,True
5,5,426.0,1,23.1,2015-02-04 17:55:00,704.5,27.2,0.004757,True
...,...,...,...,...,...,...,...,...,...
5411,5411,65.7,0,19.2,NaN,423.3,30.8,0.004235,True
6547,6547,0.0,0,19.3,NaN,463.0,26.1,0.003606,True
1806,1806,0.0,0,20.2,NaN,445.0,21.2,0.003104,True
5606,5606,58.8,0,20.1,NaN,420.2,26.3,0.003830,True
3689,3689,0.0,0,19.6,NaN,449.0,19.3,0.002729,True

In [60]:
info["v3"].isna().sum()

np.int64(1000)